<?php

use nullref\core\traits\MigrationTrait;
use yii\db\Migration;

class m161020_172823_add_subject_data extends Migration
{
    use MigrationTrait;

    public function up()
    {
        $this->batchInsert('{{%subject}}', ['id', 'title', 'code', 'short_name', 'practice'],
            [
                [1, 'Географія', 'ЗО.13', 'Географія', NULL],
                [2, 'Біологія', 'ЗО.12', 'Біологія', NULL],
                [3, 'Фізика', 'ЗО.10', 'Фізика', NULL],
                [4, 'Астрономія', 'ЗО.11', 'Астрономія', NULL],
                [5, 'Геометрія', 'ЗО.09', 'Геометрія', NULL],
                [6, 'Алгебра', 'ЗО.09', 'Алгебра', NULL],
                [7, 'Людина і світ', 'ЗО.07', 'Людина і світ', NULL],
                [8, 'Художня культура', 'ЗО.08', 'Худ.культура', NULL],
                [9, 'Дискретні структури', '4,11', 'Дискретні структури', NULL],
                [10, 'Економіка та організація виробництва', '4,10', 'Економіка та орг. вироб', NULL],
                [11, 'Автоматизовані інформаційні системи', '4,9', 'АІС', NULL],
                [12, 'Українська мова', 'ЗО.01', 'Укр.мова', NULL],
                [13, 'Українська література ', 'ЗО.02', 'Укр.літ', NULL],
                [14, 'Іноземна мова', 'ЗО.03', 'Іноз. мова', NULL],
                [15, 'Світова література', 'ЗО.04', 'Світ.літ.', NULL],
                [16, 'Ліцензування та сертифікація програмних продуктів', '4,12', 'Ліц. та серт. ПЗ', NULL],
                [17, 'Програмування Інтернет-застосувань', '4,13', 'Програмування Інтернет-застосувань', NULL],
                [18, 'Основи програмування', '3,01', 'Осн.прог', NULL],
                [19, 'Історія  України', '1,01', 'Історія України', NULL],
                [20, 'Українська мова (за професійним спрямуванням)', '1,02', 'Укр.мова проф', NULL],
                [21, 'Культурологія', '1,03', 'Культурологія', NULL],
                [22, 'Основи філософських знань', '1,04', 'філософія', NULL],
                [23, 'Всесвітня історія', 'ЗО.06', 'Всес.іст.', NULL],
                [24, 'Історія України', 'ЗО.05', 'Іст.Укр', NULL],
                [25, 'Конструювання програмного забезпечення', '3,11', 'КПЗ', NULL],
                [26, 'Проектний практикум', '3,12', 'Прок.практикум', NULL],
                [27, 'Охорона праці', '3,13', 'Ох. праці', NULL],
                [28, 'Охорона праці в галузі', '3,15', 'Ох праці в галуз', NULL],
                [29, 'Практика з програмування', '3,15', 'Практика з прог', NULL],
                [30, 'Практика з ОС та ООП', '3,16', 'Практика з ОС та ООП', NULL],
                [31, 'Технологічна практика', '3,17', 'Технологічна практика', NULL],
                [32, 'Переддипломна практика', '3,18', 'Переддипломна практика', NULL],
                [33, 'Дипломне проктування', '3,19', 'Дипломне проктування', NULL],
                [34, 'Основи психології та педагогіки', '4,1', 'Основи психології та педагогіки', NULL],
                [35, 'Політологія', '4,2', 'Політологія', NULL],
                [36, 'Підприємництво та менеджмент', '4,3', 'Підприємництво та менеджмент', NULL],
                [37, 'Англійська мова (технічний переклад)', '4,4', 'Англійська мова (технічний переклад)', NULL],
                [38, 'Комп\'ютерна графіка', '4,5', 'Комп\'ютерна графіка', NULL],
                [39, 'Групова дінаміка і комунікації', '4,6', 'ГДК', NULL],
                [40, 'Засоби системного програмування', '4,7', 'ЗСП', NULL],
                [41, 'Дослідження операцій', '4,8', 'Досл. операцій', NULL],
                [42, 'Вступ в спеціальність', '3.01', 'Вступ ', NULL],
                [43, 'Об\'єктно-орієнтоване програмування', '3,02', 'ООП', NULL],
                [44, 'Алгоритми і структури даних', '3,03', 'Алг і стр.дан', NULL],
                [45, 'Операційні системи', '3,04', 'ОС', NULL],
                [46, 'Інструментальні засоби візуального програмування', '3,05', 'ІЗВП', NULL],
                [47, 'Бази даних', '3,06', 'БД', NULL],
                [48, 'Людинно-машинна взаємодія', '3,08', 'ЛМВ', NULL],
                [49, 'Архітектура комп\'ютерів', '3.08', 'Арх. комп', NULL],
                [50, 'Організація комп\'ютерних мереж', '3,09', 'ОКМ', NULL],
                [51, 'Основи програмної інженерії', '3,10', 'ОПІ', NULL],
                [52, 'Математика', 'ЗО.09', 'Математика', NULL],
                [53, 'Інформатика', 'ЗО.17', 'Інформатика', NULL],
                [54, 'Економічна теорія', '1,05', 'Економіка', NULL],
                [55, 'Основи правознавства', '1,06', 'Правознавство', NULL],
                [56, 'Іноземна мова (за професійним спрямуванням)', '1,08', 'Іноз. мова (проф.)', NULL],
                [57, ' Фізика ', '2,02', 'Фізика', NULL],
                [58, 'Лінійна алгебра та аналітична геометрія', '2,03', 'Лін. алгебра', NULL],
                [59, 'Математичний аналіз', '2,04', 'мат. аналіз', NULL],
                [60, 'Дискретна математика', '2,07', 'дис. математика', NULL],
                [61, 'Безпека життєдіяльності', '2,09', 'БЖД', NULL],
                [62, 'Правознавство', 'ЗО.07', 'Правознавство', NULL],
                [63, 'Технології', '3,10', 'технології', NULL],
                [64, 'Диференціальні рівняння', '2,05', 'диф. рівняння', NULL],
                [65, 'Фізичне виховання', '1,09', 'фіз. вих.', NULL],
                [66, 'Теорія ймовірності і матем. статистика', '2,06', 'ТІ і матем. стат.', NULL],
                [67, 'Чисельні методи', '2,08', 'чис. методи', NULL],
                [68, 'Основи охорони праці', '3,13', 'Осн. ОП', NULL],
                [69, 'Основи веб-програмування', '4,7', 'веб-програмування', NULL],
                [70, 'Соціологія', '1,07', 'соціологія', NULL],
                [71, 'Людино-машинна взаємодія', '3,07', 'ЛМВ', NULL],
                [72, 'Економіка програмної інженерії', '4,10', 'економіка ПІ', NULL],
                [73, 'Вища математика', '2,1', 'вища математика', NULL],
                [74, 'Теорія електричних та магнітних кіл', '2,4', 'ТЕМК', NULL],
                [75, 'Комп\'ютерна логіка', '2,8', 'КЛ', NULL],
                [76, 'Програмування', '3,3', 'програмування', NULL],
                [77, 'Основи електроніки', '3,4', 'основи електроніки', NULL],
                [78, 'Інженерна та комп\'ютерна графіка', '2,3', 'ІТКГ', NULL],
                [79, 'Алгоритми та методи обчислень', '2,7', 'АТМО', NULL],
                [80, 'Комп\'ютерна електроніка', '3,01', 'КЕ', NULL],
                [81, 'Електрорадіовимірювання', '3,4', 'електрорадіовимірювання', NULL],
                [82, 'Системне програмування', '2,10', 'сис. програмування', NULL],
                [83, 'Комп\'ютерна схемотехніка', '3,11', 'КС', NULL],
                [84, 'Периферійні пристрої', '3,08', 'ПП', NULL],
                [85, 'Комп\'ютерні системи та мережі', '3,09', 'КСТМ', NULL],
                [86, 'Надійність, діагностика та експлуатація КС та КМ.', '3,12', 'НДТЕКС', NULL],
                [87, 'Економіка і планування виробництва', '3,14', 'економіка', NULL],
                [88, 'Захист інформації в комп\'ютерних системах', '3,4', 'ЗІВКС', NULL],
                [89, 'Хімія', 'ЗО.14', 'Хімія', NULL],
                [90, 'Екологія', 'ЗО.15', 'Екологія', NULL],
                [91, 'Технології (Вступ в спеціальність)', 'ЗО.16', 'Технології', NULL],
                [92, 'Інформатика (основи програмування)', 'ЗО.17', 'Інформатика', NULL],
                [93, 'Фізична культура', 'ЗО.18', 'Фіз.культ', NULL],
                [94, 'Захист Вітчизни', 'ЗО.19', 'Захист Вітчизни', NULL],
                [95, 'Економіка', 'ЗО.07', 'Економіка', NULL],
            ]
        );
    }

    public function down()
    {
        $this->truncateTable('{{%subject}}');
    }

    public function to()
    {
        $this->truncateTable('{{%subject}}');
    }
}
